In [1]:
import numpy as np
import pandas as pd
from pathlib import Path
%matplotlib inline

In [2]:
from os import listdir
from os.path import isfile

In [3]:
dir = "../Resources/"

In [18]:
all_files = [x for x in listdir(dir) if (".xlsx" in x or ".csv" in x)]
all_files

['corn.xlsx',
 'live cattle.xlsx',
 'corn_2.xlsx',
 'feeder cattle.xlsx',
 'soybean meal.xlsx',
 'lean hogs.xlsx']

In [10]:
# pip install xlrd==1.2.0

In [29]:
all_df = []
for x in all_files:
    a = x.replace(".xlsx", "")
    df = pd.read_excel(dir+x)
    df["name"] = a
    df["Date"] = pd.to_datetime(df["Date"])
    df = df.set_index("Date")
    df = df.sort_index()
    display(df)
    all_df.append(df)

             Price  Volume  name
Date
2010-11-08  5.8525  181957  corn
2010-11-09  5.7625  368624  corn
2010-11-10  5.6675  234149  corn
2010-11-11  5.6400  240557  corn
2010-11-12  5.3400  270071  corn
...            ...     ...   ...
2021-10-25  5.3800   90174  corn
2021-10-26  5.4350  133888  corn
2021-10-27  5.5725  216908  corn
2021-10-28  5.6275  147522  corn
2021-10-29  5.6825  121183  corn

[2767 rows x 3 columns]

              Price   Volume         name
Date
1985-01-02   65.600      NaN  live cattle
1985-01-03   65.300      NaN  live cattle
1985-01-04   65.200      NaN  live cattle
1985-01-07   65.000      NaN  live cattle
1985-01-08   64.750      NaN  live cattle
...             ...      ...          ...
2021-10-28  130.325  16981.0  live cattle
2021-10-29  129.275  23695.0  live cattle
2021-11-01  128.850  18604.0  live cattle
2021-11-02  129.950  19957.0  live cattle
2021-11-03  131.650  26570.0  live cattle

[9270 rows x 3 columns]

             Price    Volume    name
Date
1985-01-02  2.7325       NaN  corn_2
1985-01-03  2.7150       NaN  corn_2
1985-01-04  2.6950       NaN  corn_2
1985-01-07  2.6850       NaN  corn_2
1985-01-08  2.6625       NaN  corn_2
...            ...       ...     ...
2021-10-28  5.6275  164258.0  corn_2
2021-10-29  5.6825  121183.0  corn_2
2021-11-01  5.7900  177181.0  corn_2
2021-11-02  5.7300  160418.0  corn_2
2021-11-03  5.6400  133940.0  corn_2

[9292 rows x 3 columns]

              Price  Volume           name
Date
1985-01-22   70.700     NaN  feeder cattle
1985-01-23   70.700     NaN  feeder cattle
1985-01-24   70.750     NaN  feeder cattle
1985-01-25   70.750     NaN  feeder cattle
1985-01-28   71.400     NaN  feeder cattle
...             ...     ...            ...
2021-10-28  157.650  1828.0  feeder cattle
2021-10-29  156.575  1856.0  feeder cattle
2021-11-01  154.400  2638.0  feeder cattle
2021-11-02  157.575  1478.0  feeder cattle
2021-11-03  159.175  1876.0  feeder cattle

[9116 rows x 3 columns]

            Price  Volume          name
Date
2010-11-08  344.9   27924  soybean meal
2010-11-09  362.3   42162  soybean meal
2010-11-10  355.4   33607  soybean meal
2010-11-11  358.1   31529  soybean meal
2010-11-12  339.7   56614  soybean meal
...           ...     ...           ...
2021-10-25  327.2   43897  soybean meal
2021-10-26  326.9   41114  soybean meal
2021-10-27  330.9   54389  soybean meal
2021-10-28  330.9   41321  soybean meal
2021-10-29  332.6   37553  soybean meal

[2767 rows x 3 columns]

             Price  Volume       name
Date
2020-11-09  81.250       6  lean hogs
2020-11-10  81.250      99  lean hogs
2020-11-11  80.975      66  lean hogs
2020-11-12  81.625      41  lean hogs
2020-11-13  79.800      72  lean hogs
...            ...     ...        ...
2021-10-25  91.875      11  lean hogs
2021-10-26  90.400      16  lean hogs
2021-10-27  89.775       9  lean hogs
2021-10-28  93.100     176  lean hogs
2021-10-29  94.075      63  lean hogs

[246 rows x 3 columns]

In [ ]:
df = pd.concat(all_df)
df = df.dropna()
df = df.sort_index()
df

In [32]:
# all_df[1]